app/controllers/customers_controller.rb

  def index
    @customers = Customer.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT * FROM `customers` ORDER BY created_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `customers`

  def edit
    @customer = Customer.find(params[:id])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 2)

  def show
    @customer = Customer.find(params[:id])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 2)

  def update
    @customer = Customer.find(params[:id])

    if @customer.blank?
      flash[:error]  = "Invalid edit record"
      redirect_to customers_path
    end
    success = @customer.update_attributes(params[:customer])
---
SELECT * FROM `customers` WHERE (`customers`.`id` = 2)
UPDATE `customers` SET `updated_at` = '2011-06-16 16:14:31', `last_name` = 'ddsa', `first_name` = 'as' WHERE `id` = 2

  def create
    @customer = Customer.new(params[:customer])
    success = @customer && @customer.save
---
INSERT INTO `customers` (`city`, `work_phone`, `zip`, `created_at`, `company_name`, `country`, `updated_at`, `address_1`, `last_name`, `website`, `phone`, `fax`, `address_2`, `state_id`, `first_name`, `email`, `mobile_phone`) VALUES('', '', '', '2011-06-25 20:54:41', '', NULL, '2011-06-25 20:54:41', '', '', '', NULL, '', '', 1, '', '', '')

  def search
    @customers = Customer.paginate(
      :page => params[:page],
      :order => 'created_at DESC',
      :conditions => ["company_name LIKE ? OR first_name LIKE ? OR last_name LIKE ?"] + ["%#{params[:q]}%"]*3
    )
---
SELECT * FROM `customers` WHERE (company_name LIKE '\'%abcd%\'' OR first_name LIKE '\'%abcd%\'' OR last_name LIKE '\'%abcd%\'') ORDER BY created_at DESC LIMIT 0, 10