app/controllers/tickets_controller.rb

  def index
    extra_params = {}
    unless current_user.user_access.is_admin
      extra_params.merge!({:conditions => ["assignee_id = ?", current_user.id]})
    end

    @tickets = Ticket.paginate({:page => params[:page],
        :order => 'created_at DESC',
        :include => [:ticket_status, :ticket_priority]}.merge(extra_params))
---
SELECT * FROM `tickets` WHERE (assignee_id = 2) ORDER BY created_at DESC LIMIT 0, 10

  def create
    @ticket = Ticket.new(params[:ticket])
    success = @ticket && @ticket.save
---
INSERT INTO `tickets` (`ticket_category_id`, `start_date`, `ticket_status_id`, `created_at`, `assignee_id`, `updated_at`, `added_by_id`, `subject`, `ticket_priority_id`, `description`, `customer_id`, `end_date`) VALUES(NULL, NULL, 1, '2011-07-11 20:51:25', NULL, '2011-07-11 20:51:25', 3, 'abcd', 1, '', NULL, NULL)

  def show
    @ticket = Ticket.find(params[:id], :include => [{:ticket_notes => :ticket_changes}])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` IN (1,'--- \n:ticket_notes: :ticket_changes\n'))
SELECT `ticket_changes`.* FROM `ticket_changes` WHERE (`ticket_changes`.ticket_note_id IN (1,2))
SELECT `ticket_notes`.* FROM `ticket_notes` WHERE (`ticket_notes`.ticket_id = 1)

  def edit
    @ticket = Ticket.find(params[:id])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 4)

  def update
    @ticket = Ticket.find(params[:id])
    tn = TicketNote.new(params["ticket_note"])
    params["ticket"].each do |k, v|
      story = @ticket.get_ticket_change_story(k, v)
      tn.ticket_changes << story if story
    end

    Ticket.transaction do
      if tn.ticket_changes.size > 0 or !tn.comments.blank?
        TicketNote.transaction do
          @ticket.ticket_notes << tn
        end
      end
      @ticket.update_attributes(params["ticket"])
---
SELECT * FROM `tickets` WHERE (`tickets`.`id` = 4)
SELECT * FROM `tickets` LIMIT 1
INSERT INTO `ticket_changes` (`new_value`, `created_at`, `ticket_note_id`, `updated_at`, `old_value`, `changed_field`) VALUES('In Progress', '2011-07-13 23:35:28', 1, '2011-07-13 23:35:28', 'In Progress', 'Status')
INSERT INTO `ticket_notes` (`updated_by_id`, `created_at`, `comments`, `updated_at`, `ticket_id`) VALUES(1, '2011-07-13 23:35:28', '', '2011-07-13 23:35:28', 4)
SELECT * FROM `ticket_notes` WHERE (`ticket_notes`.ticket_id = 2)
UPDATE `tickets` SET `updated_at` = '2011-07-19 18:20:47', `ticket_category_id` = 1, `description` = 'this is sample description\r\nthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample descriptionthis is sample description' WHERE `id` = 3