app/controllers/ticket_categories_controller.rb

SELECT * FROM `ticket_categories` ORDER BY created_at DESC LIMIT 0, 10
---
  def index
    @ticket_categories = TicketCategory.paginate :page => params[:page], :order => 'created_at DESC'

SELECT * FROM `ticket_categories` WHERE (`ticket_categories`.`id` = 2)
---
  def edit
    @ticket_category = TicketCategory.find(params[:id])

SELECT * FROM `ticket_categories` WHERE (`ticket_categories`.`id` = 2)
---
  def show
    @ticket_category = TicketCategory.find(params[:id])

SELECT * FROM `ticket_categories` WHERE (`ticket_categories`.`id` = 2)
UPDATE `ticket_categories` SET `updated_at` = '2011-06-25 23:00:09', `name` = 'asdkjsssaksd', `comments` = 'asdbasdkjahsasdabd' WHERE `id` = 2
---
  def update
    @ticket_category = TicketCategory.find(params[:id])

    if @ticket_category.blank?
      flash[:error]  = "Invalid edit record"
      redirect_to ticket_categories_path and return false
    end
    success = @ticket_category.update_attributes(params[:ticket_category])

INSERT INTO `ticket_categories` (`name`, `created_at`, `comments`, `updated_at`) VALUES('asdkjaksd', '2011-06-25 22:59:31', 'asdbasdkjahsbd', '2011-06-25 22:59:31')
---
  def create
    @ticket_category = TicketCategory.new(params[:ticket_category])
    success = @ticket_category && @ticket_category.save