app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY created_at DESC LIMIT 0, 10
SELECT `user_accesses`.* FROM `user_accesses` WHERE (`user_accesses`.user_id IN (2,1))
---
  def index
    @users = User.paginate :page => params[:page], :order => 'created_at DESC', :include => :user_access

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `user_accesses`.* FROM `user_accesses` WHERE (`user_accesses`.user_id = 1)
---
  def show
    @user = User.find(params[:id], :include => :user_access)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `user_accesses`.* FROM `user_accesses` WHERE (`user_accesses`.user_id = 1)
---
  def edit
    @user = User.find(params[:id], :include => :user_access)

INSERT INTO `user_accesses` (`created_at`, `comments`, `can_create_ticket`, `updated_at`, `can_edit_customer`, `user_id`) VALUES('2011-06-16 21:40:04', 'can do tickets .. but no customers plz', 1, '2011-06-16 21:40:04', 0, 2)
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('Hassan Sagi', '4874cfea27aa9a4bb899d62480156c2c4b9fab9f', '2011-06-16 21:40:04', '3ab1c369f5c74e04dcdffabb1f4073c322ba4fdd', NULL, '2011-06-16 21:40:04', NULL, 'sagi', 'sagi@serve.com')
SELECT * FROM `users`
SELECT `user_accesses`.* FROM `user_accesses` WHERE (`user_accesses`.user_id = 1)
---
  def create
    @user = User.new(params[:user])
    @user.user_access = UserAccess.new(params[:user_access])

    success = @user && @user.save
    SFactory.all_users(true)  #update the locally maintained customers list from db

    if success && @user.errors.empty?

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `users`
UPDATE `users` SET `updated_at` = '2011-07-10 21:34:17', `crypted_password` = '41aa3efcb93e67eb77bb71752016f626d773cb11' WHERE `id` = 3
UPDATE `user_accesses` SET `updated_at` = '2011-08-01 18:45:21', `manage_ticket_categories` = 1, `manage_agents` = 1 WHERE `id` = 1
SELECT `user_accesses`.* FROM `user_accesses` WHERE (`user_accesses`.user_id = 1)
---
  def update
    @user = User.find(params[:id])

    if @user.blank?
      flash[:error]  = "Invalid edit record"
      redirect_to users_path
    end
    success = @user.update_attributes(params[:user]) and
      @user.user_access.update_attributes(params[:user_access])

    SFactory.all_users(true)  #update the locally maintained customers list from db

    if success && @user.errors.empty?